<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"8163843f26a4cd7407862109a07246a377662010bb5e57ba6317a0a4c29cb451","plan_job_ref":"Job CI-CD pipeline #15 at https://github.com/HasanAshab/spring-react-devops-appservice-infra/actions/runs/15865094279","plan_out_hash":"ba44c2161995e4d3517ae6dbf0f90af5413648f80d3aae3801fb9e31fc2b8285","plan_hash":"23002b1cef77f175c3dac3e5fe3b0acb712800999f0c76d8a12f5eaaf7134e88","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __.__ in the __prod__ workspace
With var files: `prod.tfvars`
<details>
<summary>Plan: 12 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "northeurope"
+       name     = "rg-three-tier-app-prod"
+       tags     = {
+           "Environment" = "prod"
+           "Service"     = "three-tier-app"
        }
    }

  # module.app.azurerm_linux_web_app.main will be created
+   resource "azurerm_linux_web_app" "main" {
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "northeurope"
+       name                                           = "app-three-tier-app-prod-northeurope-001"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-prod"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-backend:latest"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.app.azurerm_private_endpoint.app will be created
+   resource "azurerm_private_endpoint" "app" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "northeurope"
+       name                     = "pe-app-three-tier-app-prod-northeurope-001"
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = "rg-three-tier-app-prod"
+       subnet_id                = (known after apply)

+       private_dns_zone_group {
+           id                   = (known after apply)
+           name                 = "default"
+           private_dns_zone_ids = (known after apply)
        }

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = "default"
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "sites",
            ]
        }
    }

  # module.app.azurerm_service_plan.main will be created
+   resource "azurerm_service_plan" "main" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "northeurope"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "sp-app-three-tier-app-prod-northeurope-001"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-three-tier-app-prod"
+       sku_name                        = "B1"
+       worker_count                    = 2
    }

  # module.app.azurerm_subnet.main will be created
+   resource "azurerm_subnet" "main" {
+       address_prefixes                              = [
+           "10.254.1.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "snet-app-three-tier-app-prod-northeurope-001"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-prod"
+       virtual_network_name                          = "vnet-three-tier-app-prod-northeurope-001"
    }

  # module.dns.azurerm_private_dns_zone.main will be created
+   resource "azurerm_private_dns_zone" "main" {
+       id                                                    = (known after apply)
+       max_number_of_record_sets                             = (known after apply)
+       max_number_of_virtual_network_links                   = (known after apply)
+       max_number_of_virtual_network_links_with_registration = (known after apply)
+       name                                                  = "privatelink.azurewebsites.net"
+       number_of_record_sets                                 = (known after apply)
+       resource_group_name                                   = "rg-three-tier-app-prod"

+       soa_record (known after apply)
    }

  # module.dns.azurerm_private_dns_zone_virtual_network_link.main will be created
+   resource "azurerm_private_dns_zone_virtual_network_link" "main" {
+       id                    = (known after apply)
+       name                  = "dns-link"
+       private_dns_zone_name = "privatelink.azurewebsites.net"
+       registration_enabled  = false
+       resource_group_name   = "rg-three-tier-app-prod"
+       virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_virtual_network.main will be created
+   resource "azurerm_virtual_network" "main" {
+       address_space                  = [
+           "10.254.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "northeurope"
+       name                           = "vnet-three-tier-app-prod-northeurope-001"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-three-tier-app-prod"
+       subnet                         = (known after apply)
+       tags                           = {
+           "Environment" = "prod"
+           "Service"     = "three-tier-app"
        }
    }

  # module.web.azurerm_app_service_virtual_network_swift_connection.main will be created
+   resource "azurerm_app_service_virtual_network_swift_connection" "main" {
+       app_service_id = (known after apply)
+       id             = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.web.azurerm_linux_web_app.main will be created
+   resource "azurerm_linux_web_app" "main" {
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "northeurope"
+       name                                           = "web-three-tier-app-prod-northeurope-001"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-prod"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:sha-408f927aa1a757d448bce7a8687cff5edb8e5426"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.web.azurerm_service_plan.main will be created
+   resource "azurerm_service_plan" "main" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "northeurope"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "sp-web-three-tier-app-prod-northeurope-001"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-three-tier-app-prod"
+       sku_name                        = "B1"
+       worker_count                    = 2
    }

  # module.web.azurerm_subnet.main will be created
+   resource "azurerm_subnet" "main" {
+       address_prefixes                              = [
+           "10.254.0.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "snet-web-three-tier-app-prod-northeurope-001"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-prod"
+       virtual_network_name                          = "vnet-three-tier-app-prod-northeurope-001"

+       delegation {
+           name = "webapp-delegation"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_private_host = "http://app-three-tier-app-prod-northeurope-001.privatelink.azurewebsites.net"
+   web_url          = (known after apply)
```
</details>

:memo: Plan generated in [CI-CD pipeline #15](https://github.com/HasanAshab/spring-react-devops-appservice-infra/actions/runs/15865094279)